{
    "version": "https://jsonfeed.org/version/1",
    "title": "Qajaq Rolling",
    "description": "",
    "home_page_url": "https://qajaqrolling.com",
    "feed_url": "https://qajaqrolling.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "David Täng"
    },
    "items": [
        {
            "id": "https://qajaqrolling.com/3-standard-greenland-roll.html",
            "url": "https://qajaqrolling.com/3-standard-greenland-roll.html",
            "title": "3 Standard Greenland Roll",
            "summary": "The Standard Greenland Roll was the first one I learned in a bathtub of a kayak with a europaddle. I can roll most anything with this roll, I haven't tried a canoe but a surfski worked fine. I was self taught but I don't recommend&hellip;",
            "content_html": "<figure>\n<figure>\n<figure>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"687\" height=\"385\" style=\"width: 687px; height: 385px;\" src=\"https://www.youtube.com/embed/CEJVT1C84DQ\" allowfullscreen=\"allowfullscreen\"></iframe></figure>\n</figure>\n</figure>\n</figure>\n<p><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">The Standard Greenland Roll was the first one I learned in a bathtub of a kayak with a europaddle. I can roll most anything with this roll, I haven't tried a canoe but a surfski worked fine. </span></p>\n<p>I was self taught but I don't recommend it to anyone. If you're not a total nerd or a Rolling Lunatic (the name of our club) you are likely to give up. On the other hand I have probably tried every mistake I can make. I would like to give you some hints but don't think that you can learn your first roll looking at and reading my post, get an instructor. </p>\n<p>Start by warming up, lean forward over your front deck, twist your torso and look backwards, arch your back. Better still, do some yoga regularly or at least stretch and twist. <br>Lean forward as far as possible, anchor your paddle to the gunwale. You can see that I don't and the paddle moves away from it's ideal position, a distraction you can do without for starters. Capsize and just be still for a second until your head is close to the surface on the new side. This is where most beginners lose it, they don't keep their tucked position over the foredeck and end up with their head as far as possible from the surface, hanging straight down. The head is heavy, keep it in the water as close to the surface for as long as possible. If you have your head close to the foredeck and thereby close to the surface you can start \"grabbing\" the water with your shoulders. That is try to lay flat on your back with the shoulders parallel to the surface. Now simply hold the paddle with your palms up with both hands close to your shoulders and sweep your body out and aft. The paddle will follow you torso as it sweeps and if you have a climbing angle of the blade the paddle will lift you closer to the surface as you turn the qajaq with your water leg. The water leg is the leg which is closest to the water or down. Your right leg if you are surfacing on the right side of the qajaq. Keep turning the qajaq as your head approaches the aft gunwale, arch your back and push your head further down into the water. Recover on the back deck with the paddle held in a high brace position, palms up. Sit up, if you feel a bit disorientated keep the tip of the paddle in the water. </p>\n<p>Judges note:<br>As in any roll you may extend the paddle as much or little as you want. Palms shall be facing up and the body shall be leaning back, preferably laying on the back deck.  </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-02-15T12:56:00+01:00",
            "date_modified": "2023-02-23T12:11:41+01:00"
        },
        {
            "id": "https://qajaqrolling.com/2-chest-sculling.html",
            "url": "https://qajaqrolling.com/2-chest-sculling.html",
            "title": "2 Chest Sculling",
            "summary": "I thought chest sculling was a piece of cake, then I started checking what I need to do to get the two points. First of all I need to scull, earlier I simply used a pry go recover. To be able to scull all the&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/VZAFrfARXXY\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>I thought chest sculling was a piece of cake, then I started checking what I need to do to get the two points. First of all I need to scull, earlier I simply used a pry go recover. To be able to scull all the way up and not rely on a pry is not hard but different and it requires other skills. Second I need to lay down over the front deck, since it's so easy I just sit straight up but that is bad form and not a low brace or chest sculling. </p>\n<p>As I teach I tell my students to keep the qajaq as flat as possible on the surface and that is good for being able to have a stable low brace. Now this manoeuvre isn't a low brace, its a chest scull. To get points for a chest scull I need to show the judge that I have complete control of my qajaq. This means that I need to tip it over passed 90 degrees and possibly more than once. I get the support from sculling, not a face down float and a pry. </p>\n<p>Finally this manoeuvre is great for practice form as the rolls get harder. A forceful leg drive, better sweep etc. </p>\n<p>Judges note: <br> The kayak must be tipped over so that at least half the deck is submerged. </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-02-14T12:29:26+01:00",
            "date_modified": "2023-02-14T12:29:26+01:00"
        },
        {
            "id": "https://qajaqrolling.com/18-succession-of-standard-rolls.html",
            "url": "https://qajaqrolling.com/18-succession-of-standard-rolls.html",
            "title": "18 Succession of Standard Rolls",
            "summary": "By now you have probably have a reliable Greenland Standard Roll. Normally I try to do my rolls as slow as possible to develop my technique but this is different. Nothing to it? Well if you are satisfied with 3 rolls in 10 seconds fine,&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/JT4O1wPeCAA\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>By now you have probably have a reliable Greenland Standard Roll. Normally I try to do my rolls as slow as possible to develop my technique but this is different. Nothing to it? Well if you are satisfied with 3 rolls in 10 seconds fine, no extra info needed. I have seen 6 rolls and that is amazing and it can win you the competition.</p>\n<p>So yes there are a couple of tricks to get to five or six. <br>First of all, I chase that surface with my head, keep as low to the qajaq as I can. I usually don't lean all the way forward while above water but as I get into the wet I crunch. I have to twist my torso as well, it helps me to get out of the water.</p>\n<p>Second, the paddle sweep is quite different. I don't extend my paddle all the way but use the \"back part\" of it to cut into the water and pull myself in. It feels much the same as when I started to learn Sculling rolls, the first \"slashing\" of the paddle to get deep. When I get it right, and it is hard to get the correct angle of the blade together with the right force and speed, it really speeds up my capsize. </p>\n<p>Judges note: <br>The time start when the head hits the water and a roll is considered complete when the head comes out of the water. </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-02-13T12:11:10+01:00",
            "date_modified": "2023-02-13T12:11:10+01:00"
        },
        {
            "id": "https://qajaqrolling.com/34-paddle-upside-down.html",
            "url": "https://qajaqrolling.com/34-paddle-upside-down.html",
            "title": "34 Paddling Upside Down",
            "summary": "This manoeuvre is pretty straight forward. I put my paddle under the qajaq, capsize and go. Now there are a few hint to be able to go far... First of all - go straight! The points awarded are calculated from the straight line and I&hellip;",
            "content_html": "<p> </p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/Ox0YDyY75iI\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>This manoeuvre is pretty straight forward. I put my paddle under the qajaq, capsize and go. Now there are a few hint to be able to go far...</p>\n<p>First of all - go straight! The points awarded are calculated from the straight line and I normally have to paddle next to a line in the water with distance markings. If the water is clear it can be possible to see the line and adjust my path to it. I get 1 point for the first 3 meters and 1 additional point for every two meters after that. 5 meters is 2 points, so is 6 meters. </p>\n<p>I have seen paddlers rocking the qajaq to get the paddle deeper in the water as in a sprint stroke. That is a good idea both for power and for going straight.</p>\n<p>To get a low profile under water is beneficial, lower drag, longer distance. I try to have my nose on the deck but it's hard. Hard to see where I'm going and hard because I compress my lungs. </p>\n<p>The most important aspect of this manoeuvre is to hold my breath for a looooong time. I have got some help from free divers. When I practice I rarely measure my distance, more counting the seconds or strokes I make. Counting strokes are easier, seconds have a tendency for me to speed up as I get a bit stressed under water. </p>\n<p>Practice paddling upside down! There are a lot of points go gain and it's not very difficult. It can be worth as much as a Straight Jacket Roll... (23 meters = 11 points)</p>\n<p>Judges note: The distance is measured along the straight marked line. </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-02-09T11:21:43+01:00",
            "date_modified": "2023-02-11T10:29:40+01:00"
        },
        {
            "id": "https://qajaqrolling.com/32-elbow-roll.html",
            "url": "https://qajaqrolling.com/32-elbow-roll.html",
            "title": "32 Elbow Roll",
            "summary": "The elbow roll is quite a bit more difficult than the previous lay back rolls. Not as hard as the forward finishing clenched fist and brick rolls but still. Have a look at the preparations working up to the Brick roll Layback - they are&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/JLDKpl2qgso\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>The elbow roll is quite a bit more difficult than the previous lay back rolls. Not as hard as the forward finishing clenched fist and brick rolls but still. </p>\n<p>Have a look at the preparations working up to the Brick roll Layback - they are the same as to the elbow roll and then some. </p>\n<p>When I started trying the elbow roll I was amazed at how much lift I do get using my hand or fist. Not only is that lift gone in the elbow roll but there is a another more subtle difficulty. As I put my hand on the back of my head it is much harder for me to arch back. This is mostly a mental thing but also a bit of flexibility of the shoulder. When I try arching my head back in this position my elbow like to come forward. This means to me that I need to actively push my elbow out and down during the little sweep I can get. Don't get me wrong, I don't mean to push the elbow down for support like I can get from a paddle, just push it out so it lays parallel to the surface and don't point to the sky. If you push it down for support it will sink and our shoulders will knife. </p>\n<p>My arching is more pronounced and I use both my legs to turn the qajaq. I've mentioned it several times before and I have a different feeling when using both legs in lay back versus forward finishing rolls. In lay back rolls I try to push my non-water leg out, like out to the gunwhale, in forward finishing rolls I push it down, like to the bottom of the qajaq. I've found it easier to push the non-water leg out in lay back rolls as I can arch my back more, or at least it feels easier. In forward finishing i crunch my abs in this position and pushing the non-water leg down is ok. I find more momentum with my legs pushing down if the timing is right. </p>\n<p>As in all rolls, don't raise your head out of the water until last. I have good momentum in the roll in the video so I get away with it. </p>\n<p>Strangely enough I set up very differently in the elbow roll than in all the other lay back rolls. I twist my torso so I face sideways, point the elbow forward and capsize. It feels like doing a face-plant into the water. Most people try to lean forward close to the fore deck and I guess that's fine but it doesn't work for me. </p>\n<p>Lastly, hold your position - facing sideways or forward until your nose get very close to the surface before you un-tuck and sweep your torso. </p>\n<p>Judges note: The hand shall stay on the back of your head throughout the whole roll. It is ok to use the other arm as counterweight. </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-02-01T15:30:50+01:00",
            "date_modified": "2023-02-08T17:12:12+01:00"
        },
        {
            "id": "https://qajaqrolling.com/31-brick-roll-layback.html",
            "url": "https://qajaqrolling.com/31-brick-roll-layback.html",
            "title": "31 Brick Roll Layback",
            "summary": "The Brick roll Layback is mostly a mental difficulty. If you can pull off a layback hand roll this should not be too hard. Is it worth 9 points, well.... What I needed to work on progressing from the layback hand roll to the rock/brick&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/uC9A8EiS0Iw\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>The Brick roll Layback is mostly a mental difficulty. If you can pull off a layback hand roll this should not be too hard. Is it worth 9 points, well....</p>\n<p>What I needed to work on progressing from the layback hand roll to the rock/brick roll are a few things.<br>1. Start with the side sculling. Yes, the first manoeuvre on the list! Now I need to get both shoulders in the water, really arch my back to push my head down backwards into the water. I also do static brace using my free hand to push me further out from the qajaq. With a low volume qajaq as mine I don't need a paddle to do this but it feels good to have it at hand. In the floating position on my back I try to swing my upper body from as close to 90 degrees to the qajaq to my head touching the aft gunwale back and fourth simulating the body sweep in the layback roll. <br>2. When holding a 4 kg (ladies 3 kg) rock in my hand I don't want to put strain on my shoulder. To avoid that I hold the rock rather close to the gunwale and when I sweep my body simply let the rock drop. This will also put my arm in a awkward position pointing straight down in the water as l lay on the back deck. If I push the rock down I find that I stretch my shoulder badly and the momentum of the rock can pull me over. </p>\n<p>That's if folks...</p>\n<p>Judges note: It is ok to push the rock under the kayak as you complete the roll, and lift it out of the water as you sit up.   </p>\n<p> </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-02-01T15:30:04+01:00",
            "date_modified": "2023-02-11T10:25:36+01:00"
        },
        {
            "id": "https://qajaqrolling.com/30-brick-roll-reverse-sweep.html",
            "url": "https://qajaqrolling.com/30-brick-roll-reverse-sweep.html",
            "title": "30 Brick Roll Reverse Sweep",
            "summary": "The Brick roll Reverse Sweep has very much in common with the front to front brick roll so please read what I had to say about that first. I will mainly comment on differences here. I find the Brick roll Reverse Sweep a bit harder&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/UuP-ABk0_D4\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>The Brick roll Reverse Sweep has very much in common with the front to front brick roll so please read what I had to say about that first. I will mainly comment on differences here. </p>\n<p>I find the Brick roll Reverse Sweep a bit harder than the Brick roll Front to Front since I haven't found how to use the sweep in an effective way. I simply move my body to the pry position as in the front to front roll and hope for the best. I need to practice getting more power out of the sweep, or maybe it's just how I feel when doing it? </p>\n<p>My main challenge is to keep the brick/rock high in the water so it is at the surface as I reach the pry position, or \"face down float\". Not that there is much \"float\" holding a 4 kg rock over my head. If I succeed with the rock position I usually succeed, but as previously stated, there are no margins for errors. I try to use my legs to hold a \"pressure\" in my qajaq as i sweep and then as I push the rock down, crunch my abs and try to get my nose to my knee I want to really flip the qajaq to upright. Here's where an old guys anatomy can get in the way once in a while, to both lay \"flat\" with my shoulders on the surface and get my hips turned to be able to crunch. I get stuck from time to time, there is no way I can pull this roll off without a good warming up. </p>\n<p>As always I'm not quite happy with my form in the video above but I got up, didn't I? <br>A little sculling at the end, well the roll would be accepted but depending on the judge a point may be taken off. </p>\n<p>Judges note: Start holding the brick at the rear gunwale.</p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-02-01T15:29:19+01:00",
            "date_modified": "2023-02-11T10:25:12+01:00"
        },
        {
            "id": "https://qajaqrolling.com/29-brick-roll-front-to-front.html",
            "url": "https://qajaqrolling.com/29-brick-roll-front-to-front.html",
            "title": "29 Brick Roll Front to Front",
            "summary": "Now is this roll Brick F2F harder than the Clenched Fist F2F? Is it worth more points, well I am not sure. Both rolls are similar in their execution however the mental strain of holding a heavy brick or rock in my hand is very&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/nX4nCGd4MGU\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>Now is this roll Brick F2F harder than the Clenched Fist F2F? Is it worth more points, well I am not sure. Both rolls are similar in their execution however the mental strain of holding a heavy brick or rock in my hand is very different. The biggest problem is handling the rock above water, to get a good grip on it, to find the flattest surface. Once capsized the weight is neglectable (almost) and the greater surface area compared to my clenched fist is a great help during the sweep and pry. But of course it is heavy and it pulls you down. </p>\n<p>My path to getting the Brick Front to Front roll has ups and downs. This is a hard roll! If i miss out on one detail it will fail. I use a massive leg drive - both legs in opposite directions. I feel it is crucial to <span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">get the rock high enough towards the surface before the sweep and pry. To c</span><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">runch hard to get low on the front deck is no easy task so work on the stretch for hamstrings and lower back. </span></p>\n<p><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">My most common mistake is not to reach up to the surface enough.  I started working on the roll trying to hold the rock perpendicular to the qajaq but after some help I have found that a forward angle is easier. Second mistake is usually timing... There is very little room for timing errors. I can get every part right but I start the leg drive too early which results in not using the momentum from capsizing to the full extent - fail. Overthinking on the reaching for the surface will make my leg drive late and I crunch/bow into the water deeper instead of righting the last of the qajaq and swinging my torso over the front deck. </span></p>\n<p>Positive training is also important for me. Last summer (-22) I failed and failed until I swallowed my ego and started with a small rock, fist-size, simply to succeed. I almost practiced failing too much, it was actually hard even with such a small rock since my mind was set on failing as soon as I had a rock in my hand. </p>\n<p>Practice doesn't make Perfect - Practice makes Permanent! </p>\n<p>Judges note: You may hold the rock whichever way you want but it must be in the active hand. </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-02-01T15:28:03+01:00",
            "date_modified": "2023-02-11T10:24:51+01:00"
        },
        {
            "id": "https://qajaqrolling.com/28-clenched-fist-layback.html",
            "url": "https://qajaqrolling.com/28-clenched-fist-layback.html",
            "title": "28 Clenched Fist Layback",
            "summary": "Now this isn't a very hard roll, if you can do the Layback Hand roll this won't present any problems. A tiny bit more of everything and mainly leg drive. As you can see my palm isn't facing the sky all that clearly so this&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/Pca5ATT0gKM\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>Now this isn't a very hard roll, if you can do the Layback Hand roll this won't present any problems. A tiny bit more of everything and mainly leg drive. As you can see my palm isn't facing the sky all that clearly so this was a bit sloppy. </p>\n<p>Judges note: <br>The hand must be palm up during sweep and recovery. The fingers must be closed during the entire roll.</p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-01-31T16:33:10+01:00",
            "date_modified": "2023-02-11T10:24:30+01:00"
        },
        {
            "id": "https://qajaqrolling.com/27-clenched-fist-reverse-sweep.html",
            "url": "https://qajaqrolling.com/27-clenched-fist-reverse-sweep.html",
            "title": "27 Clenched Fist Reverse Sweep",
            "summary": "Yeah! Now we're talking! This roll takes all I got, not that its all that much. If you are struggling with this roll don't be discouraged, it takes time. Look on the bright side, you must be a great roller already and if David can&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/1DSrGIIT9GY\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>Yeah! Now we're talking! This roll takes all I got, not that its all that much. If you are struggling with this roll don't be discouraged, it takes time. Look on the bright side, you must be a great roller already and if David can do it, it can't be all that hard. Right?!</p>\n<p>For me this roll is mainly about getting out of that lovely relaxed meditative mode I'm in when I roll. I have to start using force, timing and be aggressive! Reaching out to get some support from that little surface I have in the sweep and forcefully flip the qajaq as early as possible. It's hard to have margins in this roll but to get any margins everything has to be timed and forcefully \"relaxed\". </p>\n<p>Life isn't fair and neither is rolling. The individuals who can do the roll makes it look easy because you can see how they are relaxed. When I try something new I usually get tense - a sure sign that a roll is going to fail. So I get all mixed up doing this roll, I have to use force and I have to be smooth and relaxed. This is very much the same as in judo practice. I've been doing Judo for 15 years and to start with I was very tense, stiff and of course got thrown a lot. To be able to perform I have to be relaxed but not passive. </p>\n<p>As you might have figured out I went through the Greenland Competition List in the pool session which I filmed so 5 seconds before the clip above I did the Clenched Fist F2F which I had to scull a bit to get up. That annoys me, shouldn't have to scull. So I'm a bit pissed off at myself when I did this one, and you can tell. It's a bit more aggressive, more power and I recovered fine. Could have been even more forcefully executed but I'm ok with this one. </p>\n<p>Judges note: <br>The fingers must be closed during the entire roll. </p>\n<p>A comment about judging, I feel that Greenland Rolling isn't about winning. I always do my best and play fair, like in golf where you are your own judge most of the time. <br>Yes, you can hold the ping-pong ball with your thumb and use your fingers for sweeping support, but do you want to earn points that way? Of course not! Personally I think that the ping-pong ball is used for the uninitiated audience. I don't need it to keep my fist clenched and the judge can't see what I'm doing under water so the judge doesn't need me to hold it. On the other hand do I get a \"breather\" when I paddle over to get the ball and to return it so it serves some function. <br>If I wanted to win I wouldn't share my path and tricks to succeed with the rolls either but if anyone get any help reading my story ...😃👍 </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-01-31T15:53:31+01:00",
            "date_modified": "2023-02-11T10:24:16+01:00"
        }
    ]
}
