{
    "version": "https://jsonfeed.org/version/1",
    "title": "Qajaq Rolling",
    "description": "",
    "home_page_url": "https://qajaqrolling.com",
    "feed_url": "https://qajaqrolling.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "David Täng"
    },
    "items": [
        {
            "id": "https://qajaqrolling.com/25-hand-roll-layback.html",
            "url": "https://qajaqrolling.com/25-hand-roll-layback.html",
            "title": "25 Hand Roll Layback",
            "summary": "The Hand roll layback is quite easy. After I had succeeded with the Norsaq layback it wasn't hard to do the Hand version of it. So, do I stop my comments here... No of course not. This roll is my goto roll in my surf/rock&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/iMZ_QnPQk7s\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>The Hand roll layback is quite easy. After I had succeeded with the Norsaq layback it wasn't hard to do the Hand version of it. So, do I stop my comments here... No of course not. This roll is my goto roll in my surf/rock hopping qajaq as I find it easier than to set up my paddle under water in current and waves. <span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">I always have a spare paddle when I'm not on rolling practice in case I loose or drop my primary. Not that I recommend dropping a paddle. I hold on to the tip of the paddle with my sweeping hand and do a Hand roll layback. </span></p>\n<p>As I practice layback rolls I try to rely less and less on hands and arms. To come out of the water using only my torso is the ultimate goal and the Hand roll layback is a great progression. I seldom throw my non-sweeping arm over the back as a counterweight and I try to use my sweeping arm as a stabiliser. This creates a feeling of a firm core with fluttering arms.  As you can see in the video I almost immediately turn over on my back, trying to get my shoulders flat on the surface. This is a very active movement, not a passive float. Legs? Well yes, but they do not have to be as active as in the harder rolls, elbow/SJ but it's an opportunity to start practice using the non-water leg. More on that topic down the line.</p>\n<p>Judges note: <br>The hand must be palm up during sweep and recovery. </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-01-31T12:01:32+01:00",
            "date_modified": "2023-01-31T12:01:32+01:00"
        },
        {
            "id": "https://qajaqrolling.com/24-hand-roll-reverse-sweep.html",
            "url": "https://qajaqrolling.com/24-hand-roll-reverse-sweep.html",
            "title": "24 Hand Roll Reverse Sweep",
            "summary": "This is a tough one! In my progression I got the Hand roll F2F rather easily but the Hand roll RS (Reverse Sweep) is another matter. Personally I went back and forth to the Norsaq RS to get the feeling and timing correct. In my&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/o3fb7ZFOo4Q\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>This is a tough one! In my progression I got the Hand roll F2F rather easily but the Hand roll RS (Reverse Sweep) is another matter. Personally I went back and forth to the Norsaq RS to get the feeling and timing correct. In my opinion I find timing to be one of the most important things as I get into harder and harder rolls. From the Norsaq RS to the Hand RS is a big step in understanding what makes the roll work. Take your time as you progress and practice positively, that is succeed! If you (like I did) struggle and fail all the time you don't learn. I fail maybe twice before I go back and make an easier variant of the roll, in this case the Norsaq RS with half a norsaq extended. That way I succeed and my body and mind get positive feedback. A judo coach made a beautiful statement when he said:-\"Practice doesn't make perfect, practice makes <em>permanent</em>.\" So true in rolling as well. If I practice a sequence of motions which fail, I train my body to do the motions, not to change it into something else. </p>\n<p>As with the Norsaq RS extend, reach out your sweeping hand and sweep past perpendicular. Non-sweeping hand on top of the gunwhale and push down to help turn the qajaq. Massive use of leg/thigh drive and I engage my legs as early as I possibly can. My aim (mentally) is to have the qajaq righted as I start my forward sweep and turn the qajaq even more after that. In the video above you can see that there is no stop in the rotation of my qajaq but an acceleration as my upper body gets a grip in the water. After that it's just a question of swinging my torso around and on to the front deck. 😁</p>\n<p>Judges note:<br>Start with the sweeping hand on the aft gunwhale.  </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-01-31T11:40:03+01:00",
            "date_modified": "2023-01-31T11:40:03+01:00"
        },
        {
            "id": "https://qajaqrolling.com/23-hand-roll-front-to-front.html",
            "url": "https://qajaqrolling.com/23-hand-roll-front-to-front.html",
            "title": "23 Hand Roll Front to Front",
            "summary": "The hand roll F2F (Front to Front) is one of my absolute favourites! No attributes, clean, swift and elegant. Now this isn't an easy roll, well everything can be easy once you've learned but it takes good understanding of what to do. If you leave&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/9BWUFlxft4E\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>The hand roll F2F (Front to Front) is one of my absolute favourites! No attributes, clean, swift and elegant. <br>Now this isn't an easy roll, well everything can be easy once you've learned but it takes good understanding of what to do. If you leave one component out, you will keep visiting the fishes. You may have noticed that my form isn't that great in the earlier F2F or RS rolls, but now I shape up. Mainly because that with the earlier rolls I could get away with it but not on this one. So, what are MY key points for doing the whole 360 Hand roll F2F? </p>\n<p>Of course all the things I previously talked about, flexibility, torso twist, leg drive, a qajaq that fits you etc. Beside this I have two key points. First to not reach out the arm perpendicular to the qajaq but at a forward angle. This gives Me a feeling of more power and it feels natural to me, perhaps since I practice it a lot. Second to push on the qajaq with my non-sweeping hand. In the video above you can see it at the very end of the roll, my thumb is still on the deck and I right the last bit of the qajaq by pushing down.  This helps in many ways. The major advantage is that I don't pull. If I wrap my hand around the qajaq I can stay closer to the deck, which helps, but I have a tendency to pull. If I pull I turn the qajaq the wrong way! It was hard to change my behaviour but I realised that by pushing I let my legdrive go the right way as well and increased the effect. When I pull with my non-sweeping hand I lift my non-water knee as well and the rotation stops to go the wrong way. </p>\n<p>The brief visit in the face down float position which is good and (almost) necessary in the Norsaq F2F is almost gone in the Hand F2F. My feeling is that I move my head from one gunwhale at capsize to the other gunwhale at recovery. The rotation is faster in the Hand roll so there isn't much time to find the face down float. Now don't get me wrong, it's not that you can forget about it, just that it isn't obvious for me or an observer that I pass through the float. </p>\n<p>Judges note: <br>The non-sweeping hand can not be used to splash the surface for support. It is good form to keep it on the gunwhale. </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-01-31T10:53:29+01:00",
            "date_modified": "2023-01-31T10:53:29+01:00"
        },
        {
            "id": "https://qajaqrolling.com/22-throwing-sticknorsaq-layback-roll.html",
            "url": "https://qajaqrolling.com/22-throwing-sticknorsaq-layback-roll.html",
            "title": "22 Throwing Stick/Norsaq Layback roll",
            "summary": "This is a rather simple roll, I use to teach it right after the Standard Greenland roll to some students if they show core flexibility. It's the roll to make the transition to handrolls as you can slowly decrease the area of the norsaq until&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/uV9JDavDQ9w\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>This is a rather simple roll, I use to teach it right after the Standard Greenland roll to some students if they show core flexibility. It's the roll to make the transition to handrolls as you can slowly decrease the area of the norsaq until it's just your hand doing the sweep. For that very reason is it a great roll to use as practice for harder rolls. Use your non sweeping hand as a counterweight to recover easier.  I focus on my core twist and try to do it as slowly as possible when I practice. If you have o low volume kayak or qajaq you can even stop in a static brace before you recover on the back deck. This is a high brace roll so keep your palms to the sky. </p>\n<p>Judge note:<br>The hand which holds the norsaq must have the palm up during sweep and recovery. </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-01-31T10:10:15+01:00",
            "date_modified": "2023-01-31T10:10:15+01:00"
        },
        {
            "id": "https://qajaqrolling.com/21-throwing-sticknorsaq-reverse-sweep.html",
            "url": "https://qajaqrolling.com/21-throwing-sticknorsaq-reverse-sweep.html",
            "title": "21 Throwing Stick/Norsaq Reverse Sweep",
            "summary": "If I had problems with the \"Norsaq F2F\" roll this is a challenge! I'm still working on all of my reverse sweep rolls, even the ones with a paddle. I guess my body hasn't found the optimum position, my sweep hasn't found the correct climbing&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/H8kYpOsfwmA\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>If I had problems with the \"Norsaq F2F\" roll this is a challenge! I'm still working on all of my reverse sweep rolls, even the ones with a paddle. I guess my body hasn't found the optimum position, my sweep hasn't found the correct climbing angle. Oh, yes I can do them but the reverse sweep had a love/hate place in my heart. One of my most used rolls when in the surf and I love it but I feel I can do a lot better. </p>\n<p>What did I do to make this one work? As with the forward finishing rolls there are similarities and differences but all the efforts I wrote down for the \"20. Norsaq F2F roll\" applies to the RS (Reverse Sweep) as well, and then some. </p>\n<p>The reaching part is more difficult as I hold the norsaq out during the whole sweep. My hips \"click\" as I sweep from the aft position, a bit uncomfortable and strange but not dangerous but it adds to the difficulty to extend my arm with the norsaq. I personally sweep quite long, past perpendicular to the qajaq and up to around 45 degrees forward before I pry. This makes the transition to coming up a bit smoother for me as my torso is leaning forward towards the bow at the end of my sweep. </p>\n<p>Leg drive and flexibility of course. I don't use the \"explosive\" drive when I get to hold a norsaq but the legdrive is forceful. I know that good teachers say that you bow with your head towards your hip on recovery. This doesn't work with my body, I have to go forward and I focus on making my nose and water knee meet. Not that I ever succeed but you understand the drive and motion. </p>\n<p>Judge notes: One hand holds the norsaq, which way you want. The other hand may not be used to push or slap the water, good form is to keep the non-sweeping hand along the gunnel.</p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-01-30T20:33:11+01:00",
            "date_modified": "2023-01-30T20:35:26+01:00"
        },
        {
            "id": "https://qajaqrolling.com/20-throwing-sticknorsaq-front-to-front-roll.html",
            "url": "https://qajaqrolling.com/20-throwing-sticknorsaq-front-to-front-roll.html",
            "title": "20. Throwing stick/Norsaq Front to Front roll",
            "summary": "Oh how I struggled with this one! In my opinion the F2F Norsaq roll is the entrance to the difficult set of rolls. I tried and tried and failed and failed for the better part of a summer. Then I got it! Lost it, got&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/y0stBANtcxw\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>Oh how I struggled with this one! In my opinion the F2F Norsaq roll is the entrance to the difficult set of rolls. I tried and tried and failed and failed for the better part of a summer. Then I got it! Lost it, got it again. Now I consider it quite easy which can explain my bad form in the video above. I really don't need to force anything since I got my basics right. So, what was the code I broke? </p>\n<p>First \"Chest sculling\", make chest sculling with a paddle feel easy and don't put much force on the paddle. <br>Second legs, this roll is hard so no cheating to start with. I really need to drive with my water leg quite forcefully. Make sure you have contact with the foredeck in your qajaq so your drive results in a qajaq turning over. <br>Third: Reach up with the norsaq all the way to the surface. That was my biggest mistake I think, not to reach with my whole body. <br>Fourth: Don't stop the pry as you get low in the water, keep pushing that norsaq all the way to the keelson. It might not do much use at the bottom but some and that may give you the leverage to pass the tipping point or \"secondary stability\" for your qajaq. <br>Fifth: Flexibility! I don't think I could have completed the Norsaq front to front roll if I haven't stretched my backside. I'm still not that flexible but a bit more flexible than the normal middle aged man (or beyond). </p>\n<p>Judge notes: One hand holds the norsaq, which way you want. The other hand may not be used to push or slap the water, good form is to keep the non-sweeping hand along the gunnel. </p>\n<p>A view of how that summer looked like, and this was a good attempt. </p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/K_lTE9fCW7Y\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-01-30T20:03:39+01:00",
            "date_modified": "2023-01-30T20:35:10+01:00"
        },
        {
            "id": "https://qajaqrolling.com/19-roll-with-avataq.html",
            "url": "https://qajaqrolling.com/19-roll-with-avataq.html",
            "title": "19 Roll with avataq",
            "summary": "This is a great illustration of one of the difficulties with the avataq roll. I simply love the catapult when my friend get shot back into the water, thank you for letting me use the footage Johanna. As you can see in the sequence above&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/vEZqttFPvYI\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>This is a great illustration of one of the difficulties with the avataq roll. I simply love the catapult when my friend get shot back into the water, thank you for letting me use the footage Johanna. <br>As you can see in the sequence above the hard part is twofold, the first to get the avataq (hunting float) around the bottom of the qajaq and then to make sure you don't fall over as it does. </p>\n<p>It's not a really hard roll if you have the correct body mechanics in place but if you try it using your paddle only to complete the roll you will find yourself in trouble. A lot of lower body movement to get the qajaq to complete slightly more than 360 degrees rotation. Once I feel the avataq coming under the hull I relax my hips/lower body to stop the qajaq to start another roll. To keep the paddle in the water so I can brace is another good idea. </p>\n<p>To be continued...</p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-01-27T11:26:49+01:00",
            "date_modified": "2023-01-27T11:38:26+01:00"
        },
        {
            "id": "https://qajaqrolling.com/33-straight-jacket-roll.html",
            "url": "https://qajaqrolling.com/33-straight-jacket-roll.html",
            "title": "33 Straight Jacket Roll",
            "summary": "Correct, I haven't made it yet. This is what I can tell you about my journey so far. Prerequisites: A strong will to succeed, the process can be a bit painful at times. A qajaq that fits you, low back deck, full contact with your&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/F5fdRcgUtMY\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>Correct, I haven't made it yet. This is what I can tell you about my journey so far.</p>\n<p>Prerequisites: <br>A strong will to succeed, the process can be a bit painful at times. <br>A qajaq that fits you, low back deck, full contact with your thighs. <br>Excellent twist in your torso (I'm not there yet)<br>An understanding of what supports you; water, shoulders, secondary stability, weight distribution inside and out. <br>You should be able to do an Elbow roll with some ease, double elbow as well. If not start there. </p>\n<p>Yoga and stretching. YES! For me this is somewhat painful but makes all the difference. And it takes time so don't set a timetable, do what you can and things will come to you. </p>\n<p>Qajaq: This is one of the reasons I got into SOF qajaq building, so I can build myself a qajaq which allows me to do a SJ roll. Not that the qajaq does anything for you but some attributes need to be fulfilled. My current one (TTD6 - TvångsTröja David #6 or Straight Jacket David #6) is great, built for this purpose alone. There are two issues with it, the masik is a tad too high and it's black, l loved my brown ones. The RRD5 (Rockhopping and Roll David#5) had a masik slightly lower and I had to push my knees under it, so I raised it 1 cm for TTD6 and now I regret it a bit. When I lean forward my arms touch the masik stopping me from getting low on the foredeck. This isn't a problem in forward finishing rolls since my arms are not in the way but....</p>\n<p>The three main things I work on at the moment are:<br>Getting my shoulders flat and parallel to the surface as I reach up towards the sky before I start the backward sweep.<br>Getting my shoulders \"wide\" at the surface and still keep my elbows to my torso. As I push my shoulders out my hands like to slip out of my armpits and my elbows like to leave my body. It feels like a mental thing, well I'll let you know...<br>Timing! If I try to recover on the back deck too soon, the qajaq isn't passed the second stability far enough and I simply capsize it back over me. If I recover too late I don't have the righting momentum of the qajaq to pull me up the last bit to get past the tipping point. </p>\n<p>With weight distribution I am thinking about the non-water leg. Should I push it out to the side to get a better weight distribution, counterweight or push it down to get more speed, more momentum in the qajaq? Perhaps it doesn't matter as long as I use it actively?</p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-01-24T13:45:30+01:00",
            "date_modified": "2023-01-25T10:27:27+01:00"
        },
        {
            "id": "https://qajaqrolling.com/01-side-sculling.html",
            "url": "https://qajaqrolling.com/01-side-sculling.html",
            "title": "01 Side Sculling",
            "summary": "Easy? Well it can be, and not... Whenever I fail any back-finishing rolls I go back to basics to side and chest sculling. It's easy to start cheating, not using your complete range of motion and the tools available. To get a 2 point score&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/-uXbEpTvyC8\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>Easy? Well it can be, and not... Whenever I fail any back-finishing rolls I go back to basics to side and chest sculling. It's easy to start cheating, not using your complete range of motion and the tools available. <br>To get a 2 point score you need to show the judge that you have control of yourself and your qajaq. At least one shoulder in the water and tip the qajaq up to at least 90 degrees. Correct, you don't try to tip the qajaq over but to keep it flat in normal conditions but this is competition. Give the judge all you can so the scoring is easy, full 2 points per side. </p>\n<p>As you practice, try to get both shoulders, your entire torso in the water, get your eyebrows wet, keep one hand \"still\" over your shoulder, sweep wide and slow. My example may not be the greatest but I'm practising. </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-01-24T13:05:20+01:00",
            "date_modified": "2023-01-25T10:27:03+01:00"
        },
        {
            "id": "https://qajaqrolling.com/greenland-competiton-rolling.html",
            "url": "https://qajaqrolling.com/greenland-competiton-rolling.html",
            "title": "Greenland Competition Rolling",
            "summary": "I would like to share with you how I got down to the Straight Jacket roll on the Greenland Rolling Competition list. Not instructions in particular. No, what I have been looking for on the net has been \"What made it work for me?\" A&hellip;",
            "content_html": "<p>I would like to share with you how I got down to the Straight Jacket roll on the Greenland Rolling Competition list. Not instructions in particular. No, what I have been looking for on the net has been \"What made it work for me?\" A personal instructor and mentor would be perfect but I haven't got one so if you don't either - here is how I taught myself and learned the rolls. </p>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/7S-RA436fyU\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-01-24T12:55:12+01:00",
            "date_modified": "2023-01-25T10:27:40+01:00"
        }
    ]
}
