{
    "version": "https://jsonfeed.org/version/1",
    "title": "Qajaq Rolling",
    "description": "",
    "home_page_url": "https://qajaqrolling.com",
    "feed_url": "https://qajaqrolling.com/feed.json",
    "user_comment": "",
    "icon": "https://qajaqrolling.com/media/website/Logo3-2.png",
    "author": {
        "name": "David Täng"
    },
    "items": [
        {
            "id": "https://qajaqrolling.com/kajakskraeddaren.html",
            "url": "https://qajaqrolling.com/kajakskraeddaren.html",
            "title": "Kajakskräddaren",
            "summary": "Vad är nu detta, Svenska!? Jo, jag har börjat bygga Skin on Frame kajaker till andra än mig själv! 😯 I och med att DU som kan tänkas vara intresserad troligen bor nära mig, så känner jag att det är mer personligt att skriva på&hellip;",
            "content_html": "<p>Vad är nu detta, Svenska!?</p>\n<p>Jo, jag har börjat bygga Skin on Frame kajaker till andra än mig själv! 😯 <br>I och med att DU som kan tänkas vara intresserad troligen bor nära mig, så känner jag att det är mer personligt att skriva på svenska. </p>\n<p>Helst bygger jag dedikerade rollkajaker, det är jag bäst på, men om du vill ha en dagsturs- eller långfärds-kajak så går det också. Kajaken byggt till DIG, enligt dina kroppsmått och till dina önskemål. På SM i Göteborg -24 var faktiskt ganska många av mina kajaker med även om de absolut flesta faktiskt var byggda för min kropp. Plats nummer 1, 2, 3 och 5 har kajaker som jag byggt. Det säger lite om hur bra det blir med en dedikerad rollkajak. </p>\n<p>Jag gör även grönlandspaddlar - hela eller delbara, norsaq och harpuner (med norsaq). </p>\n<p>Är du intresserad så kontakta mig på: </p>\n<p><a href=\"mailto:david.o.tang@gmail.com\">david.o.tang@gmail.com </a></p>\n<p>så kan vi prata vidare.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://qajaqrolling.com/media/posts/38/David-Saekerhet-1280-720.jpg\" alt=\"\" width=\"505\" height=\"284\" sizes=\"100vw\" srcset=\"https://qajaqrolling.com/media/posts/38/responsive/David-Saekerhet-1280-720-xs.jpg 300w ,https://qajaqrolling.com/media/posts/38/responsive/David-Saekerhet-1280-720-sm.jpg 480w ,https://qajaqrolling.com/media/posts/38/responsive/David-Saekerhet-1280-720-md.jpg 768w ,https://qajaqrolling.com/media/posts/38/responsive/David-Saekerhet-1280-720-lg.jpg 1024w ,https://qajaqrolling.com/media/posts/38/responsive/David-Saekerhet-1280-720-xl.jpg 1360w ,https://qajaqrolling.com/media/posts/38/responsive/David-Saekerhet-1280-720-2xl.jpg 1600w\"></figure>\n<h2>Första leveransen från Kajakskräddaren!</h2>\n<p>D-13 togs emot av sin beställare fredagen den 13 December 2024. Jag är säker på att kajaken kommer att få ett bra hem hos den tvåfaldige Danske Mästaren! Den provrollades på Kungsbackafjorden under dagen och de båda verkar komma mycket bra överens. </p>\n<figure class=\"post__image\"> <img loading=\"lazy\"  src=\"https://qajaqrolling.com/media/posts/38/D13-och-Jakob-Bisgaard-2.jpg\" alt=\"\" width=\"180\" height=\"400\" sizes=\"100vw\" srcset=\"https://qajaqrolling.com/media/posts/38/responsive/D13-och-Jakob-Bisgaard-2-xs.jpg 300w ,https://qajaqrolling.com/media/posts/38/responsive/D13-och-Jakob-Bisgaard-2-sm.jpg 480w ,https://qajaqrolling.com/media/posts/38/responsive/D13-och-Jakob-Bisgaard-2-md.jpg 768w ,https://qajaqrolling.com/media/posts/38/responsive/D13-och-Jakob-Bisgaard-2-lg.jpg 1024w ,https://qajaqrolling.com/media/posts/38/responsive/D13-och-Jakob-Bisgaard-2-xl.jpg 1360w ,https://qajaqrolling.com/media/posts/38/responsive/D13-och-Jakob-Bisgaard-2-2xl.jpg 1600w\"></figure>\n<h2>Andra leveransen från Kajakskräddaren!</h2>\n<p>D-14 togs emot den 29 december 2024. Som jag uppfattade det var kajaken mycket efterlängtad och älskad redan vid leverans. 😍 Detta var ett special upplägg där det ingick extra allt! Pulley system för att få in packning eller flytkroppar i fören och aktern, skedda som är avtagbar, en paddel nummer 45 samt instruktion för att göra en handroll. Handrollen satt 3-4 gånger på var sida under lektionen, får se om den sitter... Det var ett känslofyllt möte och avsked, D-14 är vacker och inte bara en rollkajak. D-14 har en design för att både rolla utmärkt samt vara bekväm på dagsturer. Jag hoppas att ni kommer finna mycket glädje tillsammans. Färgen är en utblandad Milori-blå.</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://qajaqrolling.com/media/posts/38/IMG_20241229_144927.jpg\" alt=\"\" width=\"191\" height=\"425\" sizes=\"100vw\" srcset=\"https://qajaqrolling.com/media/posts/38/responsive/IMG_20241229_144927-xs.jpg 300w ,https://qajaqrolling.com/media/posts/38/responsive/IMG_20241229_144927-sm.jpg 480w ,https://qajaqrolling.com/media/posts/38/responsive/IMG_20241229_144927-md.jpg 768w ,https://qajaqrolling.com/media/posts/38/responsive/IMG_20241229_144927-lg.jpg 1024w ,https://qajaqrolling.com/media/posts/38/responsive/IMG_20241229_144927-xl.jpg 1360w ,https://qajaqrolling.com/media/posts/38/responsive/IMG_20241229_144927-2xl.jpg 1600w\"></figure>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2024-12-03T20:43:11+01:00",
            "date_modified": "2025-01-08T13:42:19+01:00"
        },
        {
            "id": "https://qajaqrolling.com/skin-on-frame-material.html",
            "url": "https://qajaqrolling.com/skin-on-frame-material.html",
            "title": "Skin on Frame Material",
            "summary": "I've been asked several times where to get material for a Skin on Frame SoF build in Sweden or northen Europe. Here is a list of my suppliers which I hope will be useful for You as well. Lumber: I go to my local lumberstore&hellip;",
            "content_html": "<p>I've been asked several times where to get material for a Skin on Frame SoF build in Sweden or northen Europe. Here is a list of my suppliers which I hope will be useful for You as well. </p>\n<p>Lumber: I go to my local lumberstore for all straight lumber. I spend time to select the best Spruce lumber I can find. My suggestion is to buy a bit larger dimensions than you need and cut around the worst knots, also to laminate the gunwales to avoid weak areas. Byggmax is my store in Kungsbacka. </p>\n<p>Bending stock: I haven't found \"green\" or freshly cut bending stock yet but I keep looking. In the meantime I buy Ash planks from <a href=\"https://abitra.se/produkt/planhyvlat-ovriga-traslag/\">Abi Trä in Frölunda (Gothenburg)</a>. Same procedure here to find straight grain planks and so far the material I've got is very good. Last build (number 10) I didn't break any ribs but usually up to a third of the ribs break. </p>\n<p>Cloth: The best cloth I've found is excellent! Provided by Marcin Bober in Poland. Marcin hasn't set up a website yet but is very professional in everything he delivers. His english is understandable albeit not perfect but don't let that discourage you. Also don't be alarmed as you may be asked to use his wifes PayPal account, <a href=\"https://www.mimisoapery.com/en/\">Mimi's Soapery.</a> Among other things Marcin provides Nylon cloth of two thicknesses, 260 grams per square meter and 430 grams per square meter. I've used both and I'm very happy with it. To get in contact with Marcin check Facebook or write me and I'll set you up.  </p>\n<p>Thread/Artificial Sinew: Same supplier as above Marcin Bober! Ask for your specific colour, you may be in luck. </p>\n<p>PU varnish: Same supplier as above for 2-part PU, Marcin Bober! Works great! I sometimes use Coelan 1-part PU which I like even better as I don't have to mix it and it handles great. It cost about 3-4 times as much as Marcin's PU so it is very doubtful if it is worth it. I get Coelan from <a href=\"https://www.toplicht.de/en/paint-boatbuilding/paint-conservation/coelan-coating/3150/coelan-boat-coating-transparent-gloss-finish?number=2621-075\">Toplicht in Hamburg.</a> Three cans of 750 ml is sufficient. </p>\n<p>Leather cord: I love to use the traditional deck riggings using leather cords and sliders. I buy round english leather cord from <a href=\"https://www.tjaderlader.se/rundrem-natur-vegetabilgarvad-engelska\">Tjäderläder</a>. 5 mm for the rigging front and aft of the cockpit and 7 mm for loops front and aft to stick your paddle into. 5 m of 5 mm and 0,5-1 m of 7mm cord. They may not be the cheapest but the best I've found. Sorry to say but I don't think they have a webpage in english, send me a mail if you need help.</p>\n<p>Pigments: I use pigment in the second layer of varnish to \"dye\" my qajaqs. As the pigment is basically crushed stone it doesn't fade and is in itself an UV protection. My local supplier is <a href=\"https://claessons.com/pigment/\">Claessons Trätjära</a> at Ringön, Gothenburg. They also have the best linseed oil! The colours are of course limited but you can always mix them. In stock they have multiple variations of: White, Red, Yellow, Terra (brown), Umbra (brown), Green, Blue, and Black. </p>\n<p>If I can do anything to help or assist you in your build, don't hesitate to contact me at <a href=\"mailto:david.o.tang@gmail.com\">david.o.tang@gmail.com</a> or via Facebook, Messenger, Instagram etc. </p>\n<p>Note: I don't get any benefits from the companies mentioned above. I have been searching for suppliers in my region of the world for 5-6 years and this is the current list. </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-11-23T12:07:39+01:00",
            "date_modified": "2023-12-26T15:07:58+01:00"
        },
        {
            "id": "https://qajaqrolling.com/useful-links.html",
            "url": "https://qajaqrolling.com/useful-links.html",
            "title": "Useful links",
            "summary": "As always, a lot of people have done a lot of work a lot better than I could ever do. To start with; how do you get your first roll. I don't intend to teach the first roll as others can do that better. Perhaps&hellip;",
            "content_html": "<p>As always, a lot of people have done a lot of work a lot better than I could ever do. </p>\n<p>To start with; how do you get your first roll. I don't intend to teach the first roll as others can do that better. Perhaps I can help in person, but that's off the scope for the webpage. My recommendation is to find professional rolling teachers locally. If they are hard to find then get the DVD:</p>\n<p><a href=\"https://kayakways.net/videos/digital-downloads/\" target=\"_blank\" rel=\"noopener noreferrer\">\"This is the Roll\" by Cheri Perry and Turner Wilson of Kayakways</a>.</p>\n<p>You can find it as a Disc as well on their site: <a href=\"http://www.kayakways.net\" target=\"_blank\" rel=\"noopener noreferrer\">www.kayakways.net</a></p>\n<p>Excellent instructions and animations on Eiichi Eto's page <a href=\"http://www.storm-on.com/\">Storm On</a></p>\n<p>Paddlegear at <a href=\"https://www.chillcheater.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Reed Chillcheater</a></p>\n<p>Greenland paddles at <a href=\"https://gramkajak.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Gram Kayak</a></p>\n<p>Skin on Frame, Norwegian Wood paddles and more with Anders Thygesen at <a href=\"https://www.yourvismawebsite.com/kajakkspesialisten-as-1/lang-EN\" target=\"_blank\" rel=\"noopener noreferrer\">Kajakkspesialisten</a><br>Note that Anders sells Brooks Tuiliqs! </p>\n<p>My club \"<a href=\"www.rolltokarna.se\">The Rolling Lunatics\" or \"Rolltokarna</a>\" <figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://qajaqrolling.com/media/posts/36/Rolltokarnalogga.jpg\" alt=\"\" width=\"700\" height=\"295\" sizes=\"100vw\" srcset=\"https://qajaqrolling.com/media/posts/36/responsive/Rolltokarnalogga-xs.jpg 300w ,https://qajaqrolling.com/media/posts/36/responsive/Rolltokarnalogga-sm.jpg 480w ,https://qajaqrolling.com/media/posts/36/responsive/Rolltokarnalogga-md.jpg 768w ,https://qajaqrolling.com/media/posts/36/responsive/Rolltokarnalogga-lg.jpg 1024w ,https://qajaqrolling.com/media/posts/36/responsive/Rolltokarnalogga-xl.jpg 1360w ,https://qajaqrolling.com/media/posts/36/responsive/Rolltokarnalogga-2xl.jpg 1600w\"></figure>\n<p> </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-11-03T09:09:49+01:00",
            "date_modified": "2023-12-26T15:12:28+01:00"
        },
        {
            "id": "https://qajaqrolling.com/34-paddling-upside-down.html",
            "url": "https://qajaqrolling.com/34-paddling-upside-down.html",
            "title": "34 Paddling Upside Down",
            "summary": "This manoeuvre is pretty straight forward. I put my paddle under the qajaq, capsize and go. Now there are a few hint to be able to go far... First of all - go straight! The points awarded are calculated from the straight line and I&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"700\" height=\"393\" src=\"https://www.youtube.com/embed/OTCWnZb-3dY\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>This manoeuvre is pretty straight forward. I put my paddle under the qajaq, capsize and go. Now there are a few hint to be able to go far...</p>\n<p>First of all - go straight! The points awarded are calculated from the straight line and I normally have to paddle next to a line in the water with distance markings. If the water is clear it can be possible to see the line and adjust my path to it. I get 1 point for the first 3 meters and 1 additional point for every two meters after that. 5 meters is 2 points, so is 6 meters. </p>\n<p>I have seen paddlers rocking the qajaq to get the paddle deeper in the water as in a sprint stroke. That is a good idea both for power and for going straight.</p>\n<p>To get a low profile under water is beneficial, lower drag, longer distance. I try to have my nose on the deck but it's hard. Hard to see where I'm going and hard because I compress my lungs. </p>\n<p>The most important aspect of this manoeuvre is to hold my breath for a looooong time. I have got some help from free divers. When I practice I rarely measure my distance, more counting the seconds or strokes I make. Counting strokes are easier, seconds have a tendency for me to speed up as I get a bit stressed under water. </p>\n<p>Practice paddling upside down! There are a lot of points go gain and it's not very difficult. It can be worth as much as a Straight Jacket Roll... (23 meters = 11 points)</p>\n<p>Judges note: The distance is measured along the straight marked line. </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-03-23T10:02:48+01:00",
            "date_modified": "2024-04-04T12:02:54+02:00"
        },
        {
            "id": "https://qajaqrolling.com/33-straight-jacket-roll.html",
            "url": "https://qajaqrolling.com/33-straight-jacket-roll.html",
            "title": "33 Straight Jacket Roll",
            "summary": "I have finally made it. With the excellent help and instructions of Anne-Sofie Furuhaug and Jörgen Fagereng Wessel! Thank you! This is an excellent example of how hands on instruction is invaluable to written instructions. I posted the instructions I got from Anne-Sofie and Jörgen&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"700\" height=\"393\" src=\"https://www.youtube.com/embed/mPk2acArQCs?si=Y4M_DS8azyKkx27G\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>I have finally made it. With the excellent help and instructions of Anne-Sofie Furuhaug and Jörgen Fagereng Wessel! Thank you! This is an excellent example of how hands on instruction is invaluable to written instructions. I posted the instructions I got from Anne-Sofie and Jörgen earlier this spring but couldn't make out what I really needed to do. I invited them to come from Norway, they did and they taught me. </p>\n<p>This is what I can tell you about my journey so far.</p>\n<p>Prerequisites: <br>- A strong will to succeed, the process can be a bit painful at times. <br>- A qajaq that fits you, low back deck, full contact with your thighs. <br>- Good twist in your torso.<br>- An understanding of what supports you; water, shoulders, secondary stability, weight distribution inside and out. <br>- You should be able to do an Elbow roll with some ease, double elbow as well. If not start there. </p>\n<p>Yoga and stretching. YES! For me this is somewhat painful but makes all the difference. And it takes time so don't set a timetable, do what you can and things will come to you. </p>\n<p>Qajaq: This is one of the reasons I got into SOF qajaq building, so I can build myself a qajaq which allows me to do a SJ roll. Not that the qajaq does anything for you but some attributes need to be fulfilled. My current one (T2D5 - TvångsTröja David #5 or Strait Jacket David #5) is great, built for this purpose alone. There are two issues with it, the masik is a tad too high and it's black, l loved my brown ones. The R2D4 (Rockhopping and Roll David#4) had a masik slightly lower and I had to push my knees under it, so I raised it 1 cm for T2D5 and now I regret it a bit. When I lean forward my arms touch the masik stopping me from getting low on the foredeck. This isn't a problem in forward finishing rolls since my arms are not in the way but.... <br>Padding and a snug fit is vital for this roll. Both at the masik and at the hips. If your hips slide down in the qajaq to the water gunwale it's very hard to get past the secondary stability and on to the back deck. I have now padded my hips as much as I can without restricting butt/hip movement. </p>\n<p>The main things I work on at the moment are:<br>Getting my shoulders flat and parallel to the surface as I reach up towards the sky before I start the backward sweep.</p>\n<p>As I get to the static brace position I push my head back and try to keep my shoulders flat. I can now stay in the static brace - straight jacket style - if my timing is a bit off and I can't recover in one motion. It's clear to me now that timing is important but not crucial.<br><br>To recover to the back deck I need to ease up with my lower back first, then chest and head out of the water last. This is what Anne-Sofie and Jörgen wrote to me and later showed in detail. </p>\n<h3>Additional sources: </h3>\n<p>I also got this answer from Anne-Sofie Furuhaug and Jörgen Fagereng Wessel on Facebook:</p>\n<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xtlvy1s\">\n<div dir=\"auto\"><em>Straitjacket roll learning process:</em></div>\n</div>\n<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xtlvy1s\">\n<div dir=\"auto\"><em>I assume you already know the hand and elbow rolls.</em></div>\n</div>\n<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xtlvy1s\">\n<div dir=\"auto\"><em>I split most back ending rolls in two parts:</em></div>\n<div dir=\"auto\"><em>1) the capsized to balance brace and</em></div>\n<div dir=\"auto\"><em>2) balance brace to back deck.</em></div>\n<div dir=\"auto\"><em>For the straitjacket roll getting the first part is a matter of timing, strong hip/knee drive and sufficient twisting of upper body. The second part is what most people seem to struggle with. If you manage to use the momentum from the first part that is great, but I found that it was easier to simply learn it from balance brace.</em></div>\n</div>\n<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xtlvy1s\">\n<div dir=\"auto\"><em>Again, good twist of upper body is important, so is backward flexibility (practice the cobra stance in yoga).</em></div>\n<div dir=\"auto\"><em>I practiced a lot of balance bracing! Then it was beginning to go from balance brace to back deck with hands folded, and repeating while gradually moving the hands closer to the correct straitjacket position. In the beginning I found it helps moving my sea leg over to the other side in the kayak (every bit helps).</em></div>\n</div>\n<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xtlvy1s\">\n<div dir=\"auto\"><em>The kayak matters a lot, so does padding and fitting. I can not do the straitjacket roll in many kayaks, and I have some padding under front of the kayak (like a padded masik) and some at the hips to keep me from slipping too far to one side of the kayak. If it is too tight it limits my movement and twisting.</em></div>\n</div>\n<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xtlvy1s\">\n<div dir=\"auto\"><em>It is important to try to use the lower back muscles to try to get the lower back up on the back deck, not just the upper torso and head.</em></div>\n</div>\n<h3>I found this on Helen Wilsons site <a href=\"http://www.greenlandorbust.org\">www.greenlandorbust.org</a></h3>\n<p><em>Often when first attempting the Straitjacket Roll, the paddler tries to “sweep” onto the back deck, and essentially bumps into it. They can hang out there all day (breathing), but not actually get onto the deck. Does this sound familiar? In this description, the “sweep” is the problem. This “sweep” usually works with a hand roll, fist roll, brick roll and sometimes even the Elbow Roll, but it will not work with the Straightjacket Roll. For the Straightjacket Roll, you need to think of your upper body as a lever, and instead of trying to “sweep” onto the back deck, push your upper body toward the ground, which will give you the leverage to fully recover. Following are the steps to a successful Straightjacket Roll (described with a right-side recovery):</em></p>\n<p><em>– Place your arms against your chest with your fingers and thumbs under your armpits.</em></p>\n<p><em>– Capsize to the left with your shoulders parallel to the side of the kayak and your forehead down (this will give you a rounded spine).</em></p>\n<p><em>– RELAX until your body gets to the highest position possible on the right side of the kayak (your shoulders should be parallel to the surface).</em></p>\n<p><em>– Throw your upper body toward the ground, using your back as a lever and keeping your shoulders parallel to the surface. Simultaneously, drive hard with the right knee.</em></p>\n<p><em>– Slide up onto the back deck (your head may hit the side of the kayak during the recovery).</em></p>\n<p><em>– Helen</em></p>\n<div class=\"x11i5rnm xat24cr x1mh8g0r x1vvkbs xtlvy1s\">\n<div dir=\"auto\"> </div>\n<div dir=\"auto\"> </div>\n<div dir=\"auto\">Two pros giving their thoughts. I sincerely thank you both. </div>\n<div dir=\"auto\"> </div>\n<div dir=\"auto\">Judges note<br>Your forearms shall be pressed against your body throughout the roll and your fingers shall remain in your armpits. </div>\n<div dir=\"auto\"> </div>\n<div dir=\"auto\">Earlier attempts for reference:</div>\n<div dir=\"auto\"><iframe width=\"700\" height=\"393\" src=\"https://www.youtube.com/embed/F5fdRcgUtMY\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe><iframe loading=\"lazy\" width=\"700\" height=\"393\" src=\"https://www.youtube.com/embed/TfeMOI9bHvQ\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></div>\n</div>\n<p> </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-03-23T10:01:18+01:00",
            "date_modified": "2024-04-04T12:01:37+02:00"
        },
        {
            "id": "https://qajaqrolling.com/32-elbow-roll.html",
            "url": "https://qajaqrolling.com/32-elbow-roll.html",
            "title": "32 Elbow Roll",
            "summary": "The elbow roll is quite a bit more difficult than the previous lay back rolls. Not as hard as the forward finishing clenched fist and brick rolls but still. Have a look at the preparations working up to the Brick roll Layback - they are&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"700\" height=\"393\" src=\"https://www.youtube.com/embed/WV8S09qxpSw\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>The elbow roll is quite a bit more difficult than the previous lay back rolls. Not as hard as the forward finishing clenched fist and brick rolls but still. </p>\n<p>Have a look at the preparations working up to the Brick roll Layback - they are the same as to the elbow roll and then some. </p>\n<p>When I started trying the elbow roll I was amazed at how much lift I do get using my hand or fist. Not only is that lift gone in the elbow roll but there is a another more subtle difficulty. As I put my hand on the back of my head it is much harder for me to arch back. This is mostly a mental thing but also a bit of flexibility of the shoulder. When I try arching my head back in this position my elbow like to come forward. This means that I need to actively push my elbow out and down during the little sweep I get. Don't get me wrong, I don't mean to push the elbow down for support like I can get from a paddle, just push it out so it lays parallel to the surface and don't point to the sky. If you push it down for support it will sink and our shoulders will knife. </p>\n<p>My arching is more pronounced and I use both my legs to turn the qajaq. I've mentioned it several times before and I have a different feeling when using both legs in lay back versus forward finishing rolls. In lay back rolls I try to push my non-water leg out, like out to the gunwhale, in forward finishing rolls I push it down, like to the bottom of the qajaq. I've found it easier to push the non-water leg out in lay back rolls as I can arch my back more, or at least it feels easier. In forward finishing i crunch my abs in this position and pushing the non-water leg down is ok. I find more momentum with my legs pushing down if the timing is right. </p>\n<p>As in all rolls, don't raise your head out of the water until last. I have good momentum in the roll in the video so I get away with it. </p>\n<p>Strangely enough I set up very differently in the elbow roll than in all the other lay back rolls. I twist my torso so I face sideways, point the elbow forward and capsize. It feels like doing a face-plant into the water. Most people try to lean forward close to the fore deck and I guess that's fine but it doesn't work for me. </p>\n<p>Lastly, hold your position - facing sideways or forward until your nose get very close to the surface before you un-tuck and sweep your torso. </p>\n<p>Judges note: The hand shall stay on the back of your head throughout the whole roll. It is ok to use the other arm as counterweight. </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-03-23T09:58:09+01:00",
            "date_modified": "2024-04-04T11:54:06+02:00"
        },
        {
            "id": "https://qajaqrolling.com/31-brick-roll-layback.html",
            "url": "https://qajaqrolling.com/31-brick-roll-layback.html",
            "title": "31 Brick Roll Layback",
            "summary": "The Brick roll Layback is mostly a mental difficulty. If you can pull off a layback hand roll this should not be too hard. Is it worth 9 points, well.... What I needed to work on progressing from the layback hand roll to the rock/brick&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"700\" height=\"393\" src=\"https://www.youtube.com/embed/PnRQTBA5j5o\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>The Brick roll Layback is mostly a mental difficulty. If you can pull off a layback hand roll this should not be too hard. Is it worth 9 points, well....</p>\n<p>What I needed to work on progressing from the layback hand roll to the rock/brick roll are a few things.<br>1. Start with the side sculling. Yes, the first manoeuvre on the list! Now I need to get both shoulders in the water, really arch my back to push my head down backwards into the water. I also do static brace using my free hand to push me further out from the qajaq. With a low volume qajaq as mine I don't need a paddle to do this but it feels good to have it at hand. In the floating position on my back I try to swing my upper body from as close to 90 degrees to the qajaq to my head touching the aft gunwale back and fourth simulating the body sweep in the layback roll. <br>2. When holding a 4 kg (ladies 3 kg) rock in my hand I don't want to put strain on my shoulder. To avoid that I hold the rock close to the gunwale at capsize, and when I sweep my body simply let the rock drop. This will also put my arm in a awkward position pointing straight down in the water as l lay on the back deck. If I push the rock down I find that I stretch my shoulder badly and the momentum of the rock can pull me over. </p>\n<p>Judges note: It is ok to push the rock under the kayak as you complete the roll, and lift it out of the water as you sit up.   </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-03-23T09:57:04+01:00",
            "date_modified": "2024-04-04T11:50:39+02:00"
        },
        {
            "id": "https://qajaqrolling.com/30-brick-roll-reverse-sweep.html",
            "url": "https://qajaqrolling.com/30-brick-roll-reverse-sweep.html",
            "title": "30 Brick Roll Reverse Sweep",
            "summary": "The Brick roll Reverse Sweep has very much in common with the front to front brick roll so please read what I had to say about that first. I will mainly comment on differences here. I find the Brick roll Reverse Sweep a bit harder&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"686\" height=\"385\" style=\"width: 686px; height: 385px;\" src=\"https://www.youtube.com/embed/mwm8QVW0_6A\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>The Brick roll Reverse Sweep has very much in common with the front to front brick roll so please read what I had to say about that first. I will mainly comment on differences here. </p>\n<p>I find the Brick roll Reverse Sweep a bit harder than the Brick roll Front to Front since I haven't found how to use the sweep in an effective way. I simply move my body to the pry position as in the front to front roll and hope for the best. I need to practice getting more power out of the sweep, or maybe it's just how I feel when doing it? </p>\n<p>My main challenge is to keep the brick/rock high in the water so it is at the surface as I reach the pry position, or \"face down float\". Not that there is much \"float\" holding a 4 kg rock over my head. If I succeed with the rock position I usually succeed, but as previously stated, there are no margins for errors. I try to use my legs to hold a \"pressure\" in my qajaq as I sweep and then as I push the rock down, crunch my abs and try to get my nose to my knee. I want to really flip the qajaq to upright. Here's where an old guys anatomy can get in the way once in a while, to both lay \"flat\" with my shoulders on the surface and get my hips turned to be able to crunch. I get stuck from time to time, there is no way I can pull off this roll without a good warming up. </p>\n<p>As always I'm not quite happy with my form in the video above but I got up, didn't I? <br>A little sculling at the end, well the roll would be accepted but depending on the judge a point may be taken off. </p>\n<p>Judges note: Start holding the brick at the rear gunwale.</p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-03-23T09:55:24+01:00",
            "date_modified": "2024-04-04T11:47:51+02:00"
        },
        {
            "id": "https://qajaqrolling.com/29-brick-roll-front-to-front.html",
            "url": "https://qajaqrolling.com/29-brick-roll-front-to-front.html",
            "title": "29 Brick Roll Front to Front",
            "summary": "Now, is this roll Brick F2F harder than the Clenched Fist F2F? Is it worth more points? Well, I am not sure. Both rolls are similar in their execution however the mental strain of holding a heavy brick or rock in my hand is very&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"700\" height=\"393\" src=\"https://www.youtube.com/embed/p0EnMWD0FNM\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>Now, is this roll Brick F2F harder than the Clenched Fist F2F? Is it worth more points? Well, I am not sure. Both rolls are similar in their execution however the mental strain of holding a heavy brick or rock in my hand is very different. The biggest problem is handling the rock above water, to get a good grip on it, to find the flattest surface. Once capsized the weight is neglectable (almost) and the greater surface area compared to my clenched fist is a great help during the sweep and pry. But of course it is heavy and it pulls you down. </p>\n<p>My path to getting the Brick Front to Front roll has ups and downs. This is a hard roll! If I miss out on one detail it will fail. I use a massive leg drive - both legs in opposite directions. I feel it is crucial to get the rock high enough towards the surface before the sweep and pry. To crunch hard to get low on the front deck is no easy task so work on the stretch for hamstrings and lower back.</p>\n<p>My most common mistake is not to reach up to the surface enough.  I started working on the roll trying to hold the rock perpendicular to the qajaq but after some help I have found that a forward angle is easier. Second mistake is usually timing... There is very little room for timing errors. Even if I can get every part right, but I start the leg drive too early which results in not using the momentum from capsizing to the full extent - fail. Overthinking on the reaching for the surface will make my leg drive late and I crunch/bow into the water deeper instead of righting the last of the qajaq and swinging my torso over the front deck. </p>\n<p>Positive training is also important for me. Last summer (-22) I failed and failed until I swallowed my ego and started with a small rock, fist-size, simply to succeed. I almost practiced failing too much, it was actually hard even with such a small rock since my mind was set on failing as soon as I had a rock in my hand. </p>\n<p>Practice doesn't make Perfect - Practice makes Permanent! </p>\n<p>Judges note: You may hold the rock whichever way you want but it must be in the active hand. </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-03-23T09:54:19+01:00",
            "date_modified": "2024-04-04T11:45:46+02:00"
        },
        {
            "id": "https://qajaqrolling.com/28-clenched-fist-layback.html",
            "url": "https://qajaqrolling.com/28-clenched-fist-layback.html",
            "title": "28 Clenched Fist Layback",
            "summary": "Now this isn't a very hard roll, if you can do the Layback Hand roll this won't present any problems. A tiny bit more of everything and mainly leg drive. As you can see my palm isn't facing the sky all that clearly so this&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"700\" height=\"393\" src=\"https://www.youtube.com/embed/K8L0TkWrFLs\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>Now this isn't a very hard roll, if you can do the Layback Hand roll this won't present any problems. A tiny bit more of everything and mainly leg drive. As you can see my palm isn't facing the sky all that clearly so this was a bit sloppy. </p>\n<p>Judges note: <br>The hand must be palm up during sweep and recovery. The fingers must be closed during the entire roll.</p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-03-23T09:52:51+01:00",
            "date_modified": "2024-04-04T11:42:43+02:00"
        }
    ]
}
