{
    "version": "https://jsonfeed.org/version/1",
    "title": "Qajaq Rolling",
    "description": "",
    "home_page_url": "https://qajaqrolling.com",
    "feed_url": "https://qajaqrolling.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "David Täng"
    },
    "items": [
        {
            "id": "https://qajaqrolling.com/12-vertical-sculling-roll.html",
            "url": "https://qajaqrolling.com/12-vertical-sculling-roll.html",
            "title": "12 Vertical Sculling Roll",
            "summary": "Vertical sculling roll is the easiest of the sculling rolls according to me. As I discussed in the post for chest sculling most people don't scull at first when they lay on the belly, just pry. When I realised that I did just that, pry&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"696\" height=\"390\" style=\"width: 696px; height: 390px;\" src=\"https://www.youtube.com/embed/NLs58cgipuw\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>Vertical sculling roll is the easiest of the sculling rolls according to me. As I discussed in the post for chest sculling most people don't scull at first when they lay on the belly, just pry. When I realised that I did just that, pry while I should be chest sculling I went back and started over. That helped me to develop a powerful scull, and frankly sculling is sculling as Turner Wilson stated. Sculling is a bit different from sweeping back and forth, I go a bit faster and use a lot more blade angle. When I fail it is almost always the same mistake, too fast, not wide enough and not aggressive enough blade angle. It is a bit hard to practice but chest sculling and then vertical sculling \"roll\" is my way to go. </p>\n<p>There are some variations to this roll so be sure to check and double check the rules in your country! <br>First variation is to actually roll all the way. This is a bit easier but also more disorientating. I can use the momentum of the capsize to get up on the other side. I personally haven't practised this very much and I have problems twisting the paddle to come into the sculling/recovery position.  <br>Second is how to hold your hands. Palms in or palms out. Cheri and Turner teach palms out in their amazing video \"This is the Roll 2\" so that was the way I first learned. It makes for a rather smooth forward finish recovery. If I hold my palms out the starting position feels very familiar and is a draw stroke or bow rudder or sculling for going sideways. The sculling also feels more powerful, but forward recovery is difficult so I tend to come up almost straight. I don't think the palm in our out makes much difference to how hard the roll is so practice both if your rules don't state exactly how to score. </p>\n<p>Judges note: (Swedish rules!)<br>Up and down on the same side. Palms in or out doesn't matter but the paddle can not deviate from vertical more than normal wiggle. </p>\n<p><br><em>(Another rule set: Palms out at setup, palms in at recovery. 360 degree roll, capsize on one side and recover on the other.)</em></p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-03-10T12:04:33+01:00",
            "date_modified": "2023-03-10T12:04:33+01:00"
        },
        {
            "id": "https://qajaqrolling.com/11-shotgun-roll.html",
            "url": "https://qajaqrolling.com/11-shotgun-roll.html",
            "title": "11 Shotgun Roll",
            "summary": "The Shotgun or Armpit roll is one of the easiest on the Greenland Rolling Competition list. It's basically a Standard Greenland roll with an extremely extended paddle. This also means that I can get a lot of lift from the paddle and it may \"jump&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"697\" height=\"391\" style=\"width: 697px; height: 391px;\" src=\"https://www.youtube.com/embed/bK-BwDmJnPY\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>The Shotgun or Armpit roll is one of the easiest on the Greenland Rolling Competition list. It's basically a Standard Greenland roll with an extremely extended paddle. This also means that I can get a lot of lift from the paddle and it may \"jump out of position\" during the roll. So take it easy, no rush! I make a smooth sweep with the paddle out to perpendicular to the qajaq and use the off hand as a counterweight. I need to return to the setup position in this roll to get full points. </p>\n<p>Judges note:<br>The paddle shall be held against the shoulder, not in the armpit. </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-03-10T10:47:48+01:00",
            "date_modified": "2023-03-10T10:47:48+01:00"
        },
        {
            "id": "https://qajaqrolling.com/10-reverse-sweep-with-paddle-held-behind-head.html",
            "url": "https://qajaqrolling.com/10-reverse-sweep-with-paddle-held-behind-head.html",
            "title": "10 Reverse Sweep with paddle held behind head",
            "summary": "The Reverse Sweep with the paddle held behind head isn't as hard on the joints as some of the other strange looking rolls. It is hard to move in this position so I have found two things important to complete this roll. First to have&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"699\" height=\"392\" style=\"width: 699px; height: 392px;\" src=\"https://www.youtube.com/embed/vFLlai7PF5w\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>The Reverse Sweep with the paddle held behind head isn't as hard on the joints as some of the other strange looking rolls. It is hard to move in this position so I have found two things important to complete this roll. </p>\n<p>First to have control over my head and thereby the blade angle during the sweep. I have a tendency to bow down into the water early in reverse sweep rolls and if I do that here the blade angle will make the paddle dive. So keep your head up until the end of the sweep. </p>\n<p>Second; I find a pry at the end helpful and the pry in this roll goes the \"wrong\" way, I push the paddle out, away from the qajaq. That is why do not place the end of the blade on the neck in the setup. See, I got 50 cm or so to pry with if I need it as I do in the second/outdoor roll in the video above.</p>\n<p>As the body position is very strange in this roll (as well) I sometimes use the non-water leg instead of the water leg to raise and then the roll becomes a muscle struggle and usually fail. <br>When everything falls into place the roll is quite easy as the paddle gives you tremendous power to get up. </p>\n<p>Judges note:<br>It's ok to take your time capsizing. </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-03-09T23:28:11+01:00",
            "date_modified": "2023-03-10T10:39:59+01:00"
        },
        {
            "id": "https://qajaqrolling.com/9-standard-roll-with-paddle-held-behind-head.html",
            "url": "https://qajaqrolling.com/9-standard-roll-with-paddle-held-behind-head.html",
            "title": "9 Standard Roll with paddle held behind head",
            "summary": "This roll require some flexibility. My problem is to lean forward in this strange setup position. As you see in the video above when I'm outdoors in the ice and snow and dressed appropriately I have difficulties capsizing. I know that I can \"swing\" the&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"694\" height=\"389\" style=\"width: 694px; height: 389px;\" src=\"https://www.youtube.com/embed/9ujDsGlBSjs\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>This roll require some flexibility. My problem is to lean forward in this strange setup position. As you see in the video above when I'm outdoors in the ice and snow and dressed appropriately I have difficulties capsizing. </p>\n<p>I know that I can \"swing\" the paddle over the front of the qajaq to capsize but I try to setup in a static way, looks nicer. <br>I have to really wait this one out, to float up to the surface on the new side before starting the sweep. If I start too early the paddle will go straight down. I can arch my back in the sweep but not press my head back since the paddle angle is controlled by the neck the paddle will sink if I do. </p>\n<p>I believe that you will have to return to the setup position to get points. </p>\n<p>Judges notes: <br>It is not required to have the paddle in contact with the gunwale at setup.  </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-03-09T12:20:30+01:00",
            "date_modified": "2023-03-09T12:20:30+01:00"
        },
        {
            "id": "https://qajaqrolling.com/8-reverse-sweep-with-paddle-held-behind-back.html",
            "url": "https://qajaqrolling.com/8-reverse-sweep-with-paddle-held-behind-back.html",
            "title": "8 Reverse Sweep with paddle held behind back.",
            "summary": "This is a roll that makes me dizzy just thinking about it. Once I got used to the reverse sweep and the disorientation it provokes and now this. I felt like I was trapped in a strange bodylock the first times I tried it, I&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"631\" height=\"354\" style=\"width: 631px; height: 354px;\" src=\"https://www.youtube.com/embed/YgmzzdL3hgY\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>This is a roll that makes me dizzy just thinking about it. Once I got used to the reverse sweep and the disorientation it provokes and now this. I felt like I was trapped in a strange bodylock the first times I tried it, I couldn't move. I had friends looking and standing in the water next to me but since they couldn't do the roll either it wasn't much help. </p>\n<p>First of all, warm up thoroughly! This roll isn't quite as bad on my joints as the Spine Roll but still... </p>\n<p>To succeed I try to get the paddle on top of the qajaq so the tip can come closer to the surface. Otherwise the sweep simply goes straight down towards the bottom of the ocean/pool. For me it's hard to lean forward as much as I would like when my hands are behind me but I try. The motion is the same as in the standard RS but still it feels awkward. I try to sweep all the way so the tip of the paddle hits the side of the qajaq way in front. To do this I let my aft hand go around my back all the way. I also struggled as I was using the wrong leg, yes this roll takes out the worst in me. I also work on the blade angle, it needs to be a bit more aggressive than normal to give me more power. <br>Besides all that it's quite a fun roll! </p>\n<p>Judges note: <br>Need to be completed with the body leaning forward. </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-03-07T11:46:59+01:00",
            "date_modified": "2023-03-07T11:48:51+01:00"
        },
        {
            "id": "https://qajaqrolling.com/7-spine-roll.html",
            "url": "https://qajaqrolling.com/7-spine-roll.html",
            "title": "7 Spine Roll",
            "summary": "The Spine Roll is an odd roll. Take care of your shoulders and warm up before trying the roll. I find that the setup is ok and the capsize but when I recover there is some overstretching and it can be slightly painful. My biggest&hellip;",
            "content_html": "<figure class=\"post__video\">\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"688\" height=\"386\" style=\"width: 688px; height: 386px;\" src=\"https://www.youtube.com/embed/cuO9qBFkEBA\" allowfullscreen=\"allowfullscreen\"></iframe></figure>\n</figure>\n<p>The Spine Roll is an odd roll. Take care of your shoulders and warm up before trying the roll. I find that the setup is ok and the capsize but when I recover there is some overstretching and it can be slightly painful. </p>\n<p>My biggest struggle has been getting the end of the paddle caught on the gunwale as I recover. I want to push my head back into the water as my upper body gets on to the back deck and that is when the end of the paddle gets caught. Now stretch before you do this but I push my lower hand up my spine, right up between my shoulder blades. I try to set up that way because then I can get the tip of the paddle all the way down to the qajaq as i capsize which is an advantage. </p>\n<p>It is ok to hold the paddle up close to your ear at setup and the paddle can come out to almost 90 degrees at finish. You do need to return to the setup position to get full points. </p>\n<p>I would say that if your are not training for competition, consider to skip this one if you're older than 20. </p>\n<p>Judges note:<br>You cannot hold the paddle around the end. </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-03-07T10:49:19+01:00",
            "date_modified": "2023-03-07T11:48:39+01:00"
        },
        {
            "id": "https://qajaqrolling.com/6-reverse-sweep.html",
            "url": "https://qajaqrolling.com/6-reverse-sweep.html",
            "title": "6 Reverse Sweep",
            "summary": "The Reverse Sweep is also a great roll, love it. When I started to learn the RS I had problem with disorientation. The good news is that I can pause as I surface on the new side with the paddle pressed against the aft gunwale&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/ExMvCb4Mvdg\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>The Reverse Sweep is also a great roll, love it. <br>When I started to learn the RS I had problem with disorientation. The good news is that I can pause as I surface on the new side with the paddle pressed against the aft gunwale until I get my ups and downs straight. The sweep is really powerful if you want it to. I started with just a \"transport\" from the aft gunwale to perpendicular and then used a pry to recover. This works just fine to for the RS but with the paddle behind my back or neck it really isn't enough, I need to take advantage of the sweep. </p>\n<p>So now, many years later I try to re-learn the roll with a powerful sweep and legdrive to get the other RS rolls. </p>\n<p>As always, go both sides as soon as you get your first successful roll - it really pays off. </p>\n<p>Judges notes:<br>You need to come up with just one sweep, no sculling. </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-03-06T12:24:27+01:00",
            "date_modified": "2023-03-06T12:24:27+01:00"
        },
        {
            "id": "https://qajaqrolling.com/5-storm-roll.html",
            "url": "https://qajaqrolling.com/5-storm-roll.html",
            "title": "5 Storm Roll",
            "summary": "I love this roll! When I learned the Storm Roll I focused on moving my head from one gunwale to the other and pushing the paddle with my aft hand. In the beginning i found the forward crunching position a bit strange but now I&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/_UsNz0I_cD0\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>I love this roll!</p>\n<p>When I learned the Storm Roll I focused on moving my head from one gunwale to the other and pushing the paddle with my aft hand. In the beginning i found the forward crunching position a bit strange but now I love getting low. </p>\n<p>Last summer (2022) I fulfilled my dream in line of applied rolling. I faced a wave of about 2-3 meters about to break on top of me. Ok I put myself in that position so I was prepared. I rolled over before the wave hit and got the force of water on the bottom, made a storm roll and paddled to meet the next wave. Nothing dramatic as all went smooth but I was thrilled to carry it out. </p>\n<p>If I get knocked over at sea and have a bit of time to prepare I almost always go for the storm roll, fun, fast and reliable. </p>\n<p>Judges note:<br>The wrists shall be over the paddle, palms down. The force face on the paddle cannot be changed. </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-03-03T11:53:41+01:00",
            "date_modified": "2023-03-03T11:53:41+01:00"
        },
        {
            "id": "https://qajaqrolling.com/paddle-in-crook-of-arm.html",
            "url": "https://qajaqrolling.com/paddle-in-crook-of-arm.html",
            "title": "4 Paddle in Crook of Arm",
            "summary": "The Paddle held in the Crook of Arm roll is very similar to the SGR-Standard Greenland Roll. Everything is the same and feels the same as long as I've managed to capsize. It took a while until I could twist my body far enough to&hellip;",
            "content_html": "<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"560\" height=\"314\" src=\"https://www.youtube.com/embed/q4514TOgHCk\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe></figure>\n<p>The Paddle held in the Crook of Arm roll is very similar to the SGR-Standard Greenland Roll. Everything is the same and feels the same as long as I've managed to capsize. It took a while until I could twist my body far enough to be able to hook the paddle on the gunwale. It helps a bit to fix the paddle at the gunwale during capsize and rotation but if you can't get all the way over it's ok to swing the paddle across the qajaq as you capsize. </p>\n<p>Judges note:<br>Only one hand can touch the paddle. </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-03-03T10:58:54+01:00",
            "date_modified": "2023-03-03T10:59:07+01:00"
        },
        {
            "id": "https://qajaqrolling.com/3-standard-greenland-roll.html",
            "url": "https://qajaqrolling.com/3-standard-greenland-roll.html",
            "title": "3 Standard Greenland Roll",
            "summary": "The Standard Greenland Roll was the first one I learned in a bathtub of a kayak with a europaddle. I can roll most anything with this roll, I haven't tried a canoe but a surfski worked fine. I was self taught but I don't recommend&hellip;",
            "content_html": "<figure>\n<figure>\n<figure>\n<figure class=\"post__video\"><iframe loading=\"lazy\" width=\"687\" height=\"385\" style=\"width: 687px; height: 385px;\" src=\"https://www.youtube.com/embed/CEJVT1C84DQ\" allowfullscreen=\"allowfullscreen\"></iframe></figure>\n</figure>\n</figure>\n</figure>\n<p><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">The Standard Greenland Roll was the first one I learned in a bathtub of a kayak with a europaddle. I can roll most anything with this roll, I haven't tried a canoe but a surfski worked fine. </span></p>\n<p>I was self taught but I don't recommend it to anyone. If you're not a total nerd or a Rolling Lunatic (the name of our club) you are likely to give up. On the other hand I have probably tried every mistake I can make. I would like to give you some hints but don't think that you can learn your first roll looking at and reading my post, get an instructor. </p>\n<p>Start by warming up, lean forward over your front deck, twist your torso and look backwards, arch your back. Better still, do some yoga regularly or at least stretch and twist. <br>Lean forward as far as possible, anchor your paddle to the gunwale. You can see that I don't and the paddle moves away from it's ideal position, a distraction you can do without for starters. Capsize and just be still for a second until your head is close to the surface on the new side. This is where most beginners lose it, they don't keep their tucked position over the foredeck and end up with their head as far as possible from the surface, hanging straight down. The head is heavy, keep it in the water as close to the surface for as long as possible. If you have your head close to the foredeck and thereby close to the surface you can start \"grabbing\" the water with your shoulders. That is try to lay flat on your back with the shoulders parallel to the surface. Now simply hold the paddle with your palms up with both hands close to your shoulders and sweep your body out and aft. The paddle will follow you torso as it sweeps and if you have a climbing angle of the blade the paddle will lift you closer to the surface as you turn the qajaq with your water leg. The water leg is the leg which is closest to the water or down. Your right leg if you are surfacing on the right side of the qajaq. Keep turning the qajaq as your head approaches the aft gunwale, arch your back and push your head further down into the water. Recover on the back deck with the paddle held in a high brace position, palms up. Sit up, if you feel a bit disorientated keep the tip of the paddle in the water. </p>\n<p>Judges note:<br>As in any roll you may extend the paddle as much or little as you want. Palms shall be facing up and the body shall be leaning back, preferably laying on the back deck.  </p>",
            "author": {
                "name": "David Täng"
            },
            "tags": [
            ],
            "date_published": "2023-02-15T12:56:00+01:00",
            "date_modified": "2023-02-27T11:27:24+01:00"
        }
    ]
}
